(self.webpackChunk_N_E = self.webpackChunk_N_E || []).push([
  [670],
  {
    7389: (e, i, n) => {
      Promise.resolve().then(n.bind(n, 9704)),
        Promise.resolve().then(n.bind(n, 2743)),
        Promise.resolve().then(n.bind(n, 5725));
    },
    6046: (e, i, n) => {
      "use strict";
      var s = n(6658);
      n.o(s, "usePathname") &&
        n.d(i, {
          usePathname: function () {
            return s.usePathname;
          },
        }),
        n.o(s, "useRouter") &&
          n.d(i, {
            useRouter: function () {
              return s.useRouter;
            },
          });
    },
    9704: (e, i, n) => {
      "use strict";
      n.d(i, { default: () => l });
      var s = n(5155),
        d = n(2115);
      let l = () => {
        let [e, i] = (0, d.useState)(null);
        return (0, s.jsxs)("div", {
          className: "page-content-wrapper",
          children: [
            (0, s.jsx)("h1", {
              className: "white-header",
              children: "Правила обмена",
            }),
            (0, s.jsx)("div", {
              className: "content-panel light-background",
              children: (0, s.jsx)("div", {
                className: "editor-view-mode-shell w-full overflow-auto h-full",
                children: (0, s.jsx)("div", {
                  "aria-autocomplete": "none",
                  "aria-readonly": "true",
                  className: "ContentEditable__root",
                  "data-lexical-editor": "true",
                  style: {
                    userSelect: "text",
                    whiteSpace: "pre-wrap",
                    wordBreak: "break-word",
                  },
                  children: (0, s.jsxs)("div", {
                    className: "content",
                    children: [
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            `Правила
Пользовательское соглашение
Настоящим omn-coin уведомляет Пользователей сайта о том, что владение цифровыми финансовыми активами, а также осуществление операций с цифровыми финансовыми активами сопровождается риском потери личных финансовых средств. Стоимость цифровых валют может увеличиваться или уменьшаться, что может повлечь риск того, что Вы потеряете свои средства покупая, продавая, храня или инвестируя их в цифровые активы.
Торговля виртуальными активами и цифровыми активами также сопряжена с особыми рисками, которые обычно не свойственны официальным валютам. В отличие от большинства валют, которые поддерживаются правительствами или другими юридическими лицами, или такими товарами, как золото или серебро, виртуальные активы являются уникальным видом «необеспеченной» валюты, поддерживаемой технологиями и доверием. В настоящее время нет государственного органа, который мог бы выпускать больше виртуальной валюты или принимать корректирующие меры для защиты стоимости виртуальных активов в условиях кризиса. При работе с цифровыми финансовыми активами могут существовать иные риски, не предусмотренные настоящим Пользовательским соглашением и Администрацией сайта omn-coin.

Общие положения
Настоящее пользовательское соглашение (далее — Соглашение, Пользовательское соглашение) регулирует отношения между omn-coin и Пользователями сайта omn-coin, являющихся резидентами Российской Федерации.

Используя сайт omn-coin, Вы соглашаетесь с тем, что прочитали, поняли и приняли все условия, содержащиеся в настоящем Соглашении.

Помимо условий настоящего пользовательского соглашения, Пользователь обязан (при необходимости) предоставить подтверждение легальности происхождения денежных средств и/или криптовалютных активов.

В случае, если Вы не согласны с условиями Пользовательского соглашения, использование сайта omn-coin не допускается.

Соответствие критериям
1.1. Настоящим вы соглашаетесь и подтверждаете, что вы: достигли установленного законом возраста, необходимого для принятия настоящих условий; вам не приостанавливали и не запрещали использование Сервисов ранее.

1.2. Если вы используете Сервисы от имени юридического лица, вы также заявляете и гарантируете, что: юридическое лицо надлежащим образом зарегистрировано и действует в соответствии с действующим законодательством юрисдикции Российской Федерации, и данное юридическое лицо уполномочило вас действовать от его имени.

Термины и определения
2.1. omn-coin — это торговая марка системы, предоставляющей Пользователям возможность обмена цифровой и электронной валюты.

2.2. Сервис — система предоставления интернет-услуг по обмену, продаже и покупке цифровых и/или электронных валют.

2.3. Пользователь — это любое физическое/юридическое лицо, использующее услуги сервиса omn-coin.

2.4. Цифровая валюта — Bitcoin, Litecoin, Ethereum и любые иные валюты, основанные на блокчейне.

2.5. Электронная валюта — денежные средства, находящиеся на счетах пользователей электронных платежных систем (Qiwi, Яндекс Деньги и др.).

2.6. Платежная система — программно-аппаратный продукт, разработанный третьей стороной и представляющий собой механизм реализации учета денежных обязательств, а также организации взаиморасчетов между своими пользователями.

2.7. Услуги сервиса — оказание содействия в проведении р2р-операций между физическими лицами по купле-продаже и обмену цифровых валют, а также иные услуги, информация о которых размещена главной странице Сервиса.

2.8. Платеж — перевод цифровой валюты или фиатных средств от Пользователя к Пользователю или Сервису, а также в обратном направлении.

2.9. Заявка/Ордер — выражение намерения Пользователя воспользоваться одной из услуг, предлагаемых Сервисом, путем заполнения электронной формы через Интернет-сайт Сервиса, на условиях, описанных в Соглашении и указанных в параметрах этой Заявки.

2.10. Партнер — лицо, оказывающее Сервису услуги по привлечению Пользователей, условия оказания которых описаны в настоящем Соглашении.

2.11. Курс — стоимостное соотношение двух цифровых валют при их обмене.

Правила пользования сайтом omn-coin
3.1. Пользователь обязуется использовать сайт omn-coin исключительно в законных целях и в соответствии с настоящим Соглашением.

3.2. Сайт omn-coin предназначен для использования исключительно в личных целях. Пользуясь услугами данного сервиса, Вы даете свое согласие на передачу omn-coin достоверных данных о себе. Вы так же даете согласие на обработку личных данных.

3.2.1. Мы также можем проводить дополнительные проверки вашей информации и запрашивать у Вас любую необходимую документацию и данные связанные с обменом (паспорт, фотографию карты, видео-верификацию карты, квитанцию отправки средств и другие необходимые данные) по причине, связанной с использованием Вами услуг и/или в качестве подтверждающего доказательства для какой-либо информации, которую Вы предоставляете. Если условия предоставления данной информации не выполнены, сервис вправе отказать в предоставлении услуг без совершения возврата средств отправителю.

3.2.2. Поскольку доступ к реестрам в связи с гео-политической ситуацией затруднен, граждане Российской Федерации и других государств Евразийского региона совершая обмен, используя сервис omn-coin, соглашаются с правилами предоставления дополнительной информации, а так же, в отдельных случаях, внесением залоговой суммы до конца прохождения процедуры дополнительной верификации. Залоговая сумма определяется органами регуляторов в лице комитета Государственной Думы Российской Федерации по Финансовому рынку. После завершения прохождения верификации, сервис обязуется совершить возврат залоговой суммы пользователю в полном размере и завершить приостановленный обмен.

3.2.3. Сервис omn-coin вправе заблокировать операцию Пользователя, в целях предотвращения мошеннических и других действий, которые могут нанести финансовые и репутационные потери для Сервиса или Пользователя, на срок требуемый для проведения финансового расследования и получения подробностей по транзакции от платежного шлюза или банка эмитента.

3.3. Администрация сайта omn-coin имеет право приостановить другие заявки до окончания рассмотрения информации указанной в пункте 3.2, 3.7, 4.14, 7.4, 7.7, 7.9 предоставленной Вами.

3.4. Вы признаете, что несете ответственность за сохранение строгой конфиденциальности информации о вашем обмене, защиту вашей собственной Цифровой валюты, а также за все действия и транзакции, размещенные на данном сервисе.

3.5. Оповещения об изменениях. В случае допуска Вами ошибки при создании ордера и/или желании изменить данные ордера (кошелек получения, электронная почта, номер телефона и т.д.), Вы обязуетесь сообщить об изменениях в службу поддержки сервиса, указанную на сайте сервиса. Ни при каких обстоятельствах Компания не будет нести ответственность за убытки, которые вы можете понести в результате допуска ошибки при создании заявки на обмен цифровой или электронной валюты.

3.6. Ответственность за действия третьих лиц. Вы несете полную ответственность за все действия или бездействие любой третьей стороны, осуществляющей доступ и/или использующей информацию о вашем обмене.

3.7. Вы соглашаетесь с тем, что не будете использовать Сервисы для осуществления какой-либо преступной деятельности, включая, помимо прочего, покупку запрещенных веществ, отмывание денег, незаконные азартные игры, финансирование терроризма. Вы гарантируете, что будете строго придерживаться AML политики сервиса. Кроме того, Вы гарантируете, что не будете использовать методы для сокрытия местоположения, с которого Вы заходите на Сайт сервиса. Так же вы обязуетесь сообщать Компании по ее запросу Ваше точное и истинное местоположение. В случае, если по результатам внутреннего анализа транзакционной активности пользователя, а также с использованием специализированных технических решений, будет установлено, что AML-риск (риск отмывания денежных средств) по проведённым операциям превышает 80%, а также если деятельность пользователя будет расценена как подозрительная, потенциально связанная с запрещённой или незаконной активностью, сервис оставляет за собой право приостановить выполнение обмена, заблокировать текущие и последующие транзакции, а также отказать в проведении новых операций. В подобных случаях приостановленные обменные операции не подлежат возврату, во избежание нарушений требований финансового законодательства и норм международного комплаенса.
В ситуациях, когда уровень AML-риска по транзакции составляет менее 80%, сервис может принять решение о временной компенсации суммы обмена с удержанием дополнительной залоговой суммы, которая будет находиться на балансе до завершения углублённой проверки. Срок проведения проверки устанавливается индивидуально и зависит от множества факторов, включая степень риска, объём транзакции, предоставленные документы и уровень сотрудничества пользователя с отделом комплаенса.

Услуги, предоставляемые сайтом omn-coin
4.1. Воспользовавшись услугами Сервиса, Пользователь подтверждает, что законно владеет и распоряжается электронной и/или цифровой валютой, участвующими в соответствующем Платеже.

4.2. Сервис оказывает следующие виды услуг: Услуга по предоставлению Пользователю возможности продать в режиме реального времени другому Пользователю электронную и/или цифровую валюту.

4.3. Путем оформления Заявки Пользователь поручает, а Сервис от своего имени и за счет Пользователя, совершает действия по обмену/продаже цифровой и/или электронной валюты.

4.4. Размер комиссии Сервиса за предоставление услуг составляет 1% от суммы заявки на обмен. Комиссия учитывается при создании Заявки Пользователем, который соглашается на ее взимание после принятия правил сервиса.

4.5. В течение отведенного регламентом времени (зависимо от направления обмена) с момента получения денежных средств от Пользователя, в размере, указанном в соответствующей Заявке, Сервис может перечислить (передать) Полученную электронную или фиатную валюту на реквизиты и в размере, указанном Пользователем в Заявке, если этому не препятствуют форс-мажорные обстоятельства.

4.6. Обменный пункт не располагает возможностью отменить/совершить возврат средств по заявке пользователя, замороженной сервисом по одной из причин указанных в пунктах 3.2, 3.7, 4.14, 7.4, 7.7, 7.9.

4.7. Возможность Сервиса по перечислению (передаче) Полученной цифровой и/или электронной валюты Пользователю считается исполненной в момент списания цифровой и/или электронной валюты в соответствующей Платежной системе со счета Сервиса, что регистрируется в истории операций соответствующей Платежной системы.

4.8. Путем оформления Заявки Пользователь поручает, а Сервис от своего имени и за счет Пользователя, покупает электронную и/или цифровую валюту у другого Пользователя, а также совершает действия по передаче денежного эквивалента Пользователю в сумме, указанной в Заявке.

4.9. Все услуги сервиса omn-coin предоставляются без каких-либо явных или подразумеваемых гарантий, в частности, без подразумеваемых гарантий товарной пригодности и пригодности для определенной цели. Компания не гарантирует, что услуги omn-coin, а также сайт omn-coin будут доступны в 100% случаев для удовлетворения Ваших потребностей. Компания будет стремиться предоставить вам свои услуги как можно скорее, но нет никаких гарантий, что доступ не будет прерван или что не будет никаких задержек, сбоев, ошибок, упущений или потери передаваемой информации.

4.10. Omn-coin будет прилагать разумные усилия для обеспечения доступа к услугам и сайту omn-coin в соответствии с настоящим Соглашением. Тем не менее, omn-coin может приостановить использование сайта для технического обслуживания и приложит разумные усилия, чтобы предварительно уведомить Вас об этом. Таким образом, Вы соглашаетесь с тем, что принимаете на себя риски, связанные с тем фактом, что вы не всегда можете пользоваться услугами и сайтом omn-coin или выполнять срочные транзакции.

Дополнительные правила пользования сайтом omn-coin
4.11. Курс фиксируется при создании заявки, если Пользователь оплатил ее в течение 3 минут после создания. Если оплата не поступает в течение 3 минут, то курс более не фиксируется и сумма обмена может меняться в зависимости от рыночной цены монет выбранных пользователем для обмена. В таком случае, пользователь обязуется обратиться в службу поддержки сервиса для уточнения деталей по сумме оплаты заявки.

4.12. Если Пользователь оплатил заявку, но в силу обстоятельств желает отказаться от обмена, то отправленные пользователем средства, возврату не подлежат.

4.13. Заявку следует оплачивать исключительно через форму оплаты на сайте сервиса, которая доступна после нажатия кнопки «Перейти к оплате». Самовольная оплата по реквизитам не допускается. В противном случае заявка может быть аннулирована, а средства остановлены.

4.14. Если Пользователь перевел некорректную сумму цифровых активов по оформленной заявке, Сервис имеет право заморозить данную транзакцию сроком до 48 часов. Пользователь имеет возможность разморозить транзакцию указав номер Заявки, подтвердив свою личность, а также проведя повторную операцию по реквизитам, указанным службой поддержки после заморозки ордера на обмен. В противном случае, транзакция не будет разморожена. После разморозки ордера, сервис обязуется выполнить обмен и совершить полный возврат средств, отправленных пользователем повторно.

Стоимость услуг
5.1. Тарифы определяются руководством Сервиса и публикуются на сайте Сервиса. Руководство Сервиса вправе менять тарифы Сервиса без дополнительного уведомления.

Налогообложение
6.1. Сервис не является налоговым агентом для Пользователя и не будет уведомлять Пользователя относительно его налоговых издержек. Пользователь обязуется самостоятельно выплачивать все налоги, требуемые в соответствии с налоговым законодательством юрисдикции Российской Федерации.

6.2. В случае, если от Сервиса властями требуется уплата налогов Пользователя или покрытие задолженности, возникшей в результате отказа Пользователя платить налоги, Пользователь соглашается возмещать Сервису все данные платежи.

Гарантии и ответственность сторон
7.1. Сервис omn-coin предоставляет услуги по обмену, покупке и продаже электронных активов. Сервис omn-coin не предоставляет услуги по сбору средств, не предоставляет услуг по оплате товаров.

7.2. Сервис omn-coin не несет ответственности перед Пользователем за финансовые потери, вызванные незаконными действиями третьих сторон, которые невозможно предсказать или предотвратить.

7.3. Сервис omn-coin не несет ответственности за любые отложенные или нереализованные Заявки, вызванные ошибкой другой Платежной системы или банка, указанными пользователем в оформленной Заявке. Пользователь соглашается с тем, что в таком случае все претензии будут направлены в платежную систему или банк. Сервис omn-coin окажет необходимую помощь для подачи жалобы или требования другому партнеру или банку.

7.4. Сумма в заявке пользователя и сумма отправленная пользователем по данной заявке должны полностью совпадать. В случае неучета комиссии, или же в другом случае несовпадения суммы, пользователь обязуется совершить повторный платеж правильной суммы с учетом данной комиссии. После успешного проведения повторной транзакции сервис обязуется совершить возврат обеих транзакций совершенных пользователем. В случае несоблюдения данного правила, средства пользователя будут заморожены. По истечению 48 часов средства обозначаться как утерянная криптовалюта и будут списаны со счета сервиса omn-coin соответствующими органами регуляторов в лице Комитета Государственной Думы по финансовому рынку.

7.5. В случае обнаружения фальсификации коммуникационных потоков или оказания какого-либо негативного влияния на нормальную работу программного кода Сервиса, имеющей прямое или косвенное отношение к Заявке Пользователя, исполнение Заявки Сервисом приостанавливается, а по уже полученным средствам производится перерасчет параметров Заявки в соответствии с действующими условиями.

7.6. Сервис omn-coin не несёт ответственности за частичное или полное несоблюдение данных Условий использования, если таковое явилось следствием обстоятельств непреодолимой силы, которые невозможно предотвратить разумными мерами.

7.7. Для завершения операции возврата по причинам пунктов 3.2.2, 4.14 и 7.4, в зависимости от сети монеты и случая, может потребоваться дополнительное подтверждение контроля над кошельком путем совершения тестовой, возвратной транзакции на сгенерированный системой адрес. Параметры и сумма такой транзакции определяются автоматически в соответствии с текущими сетевыми условиями, и имеют временные ограничения.

В отдельных случаях, связанных с особенностями работы блокчейн-инфраструктуры, условия подтверждения могут быть адаптированы под текущую ситуацию с предоставлением новых временных реквизитов/суммы транзакции для однократного подтверждения.

7.8. В других случаях неисполнение обязательств, вытекающих из настоящих Условий или нарушение отдельных условий, будет рассматриваться в соответствии с законодательством той страны, в юрисдикции которой находится Пользователь.

7.9. При возникновении сетевых задержек может потребоваться инициирование дополнительной транзакции с аналогичными параметрами и исходящим адресом для активации обработки. Все дополнительно перечисленные средства автоматически возвращаются после завершения основной операции.

Ответственность Пользователя:
7.10. Пользователь несет ответственность за достоверность и полноту информации и данных, которые он предоставил во время создания заявки. В случае, если Пользователь ввел неправильные личные данные или предоставил неверные данные для исполнения Заявки, Сервис omn-coin не несёт ответственности за любые убытки Пользователя, возникшие в результате такой ошибки.

7.11. В случае согласия с настоящими Условиями Пользователь честно заявляет и подтверждает, что:

•	Он предоставил верную и правдивую информацию о себе, а также подлинные идентификационные данные / данные для обработки заявки;
•	Он не является участником операций или сделок по отмыванию денег;
•	Он не будет использовать Сервис для финансирования терроризма или других незаконных целей;
•	Он несет полную ответственность за безопасность своих учетных данных и средств;
•	Он обязуется незамедлительно сообщать о любых подозрительных действиях или утечке данных;

Порядок разрешения споров
7.12. Все споры и разногласия, возникающие между Пользователем и Сервисом, разрешаются путем переговоров. В случае невозможности достижения согласия, спор передается на рассмотрение в суд по месту нахождения Сервиса.

Изменение условий
7.13. Сервис оставляет за собой право вносить изменения в настоящее Соглашение. Изменения вступают в силу с момента их публикации на Сайте. Продолжение использования Сервиса после внесения изменений означает согласие Пользователя с новыми условиями.

Заключительные положения
7.14. Если какое-либо положение настоящего Соглашения будет признано недействительным, это не повлияет на действительность остальных положений.

7.15. Настоящее Соглашение регулируется законодательством Российской Федерации.

7.16. В том случае, если клиент заметил несоответствие с трансляцией курсов на мониторингах. Клиент обязан оповестить об этом техническую поддержку сервиса.

7.17. В том случае, если клиент воспользовался техническим сбоем на стороне обменного пункта omn-coin и обменный пункт понесет финансовые, либо репутационные потери. Данные действия будут расценены как мошенничество. Клиент подлежит блокировке, а все не завершенные заявки могут быть удержаны для компенсации потерь сервиса.

Применимое право и подсудность
8.1. Настоящее соглашение, а также все споры, связанные с ним, подлежат рассмотрению в соответствии с законодательством Российской Федерации.

Прочие условия
9.1. Использование Сервиса omn-coin в целях осуществления мошеннических и незаконных операций запрещено.

9.2. Операторы сервиса omn-coin юридически обязаны предоставлять информацию о платежах, Пользователях и Операциях любым государственным органам, имеющим законное право запрашивать соответствующую информацию.

9.3. Защита информации Пользователей и других конфиденциальных данных граждан обеспечивается в соответствии с действующим законодательством о хранении персональных данных, в соответствии с юрисдикцией Российской Федерации.

9.4. Способ обработки и защиты личной информации подробно описан в Политике конфиденциальности, опубликованной на веб-сайте Сервиса omn-coin, требуемой для заключения договорных отношений между Пользователем и Сервисом omn-coin.

9.5. Сервис omn-coin, в случае подозрительных действий в процессе оформления заявки Пользователем, во избежание ущерба от хакерских атак, вправе приостанавливать выполнение таких операций до выяснения причин этих действий.

9.6. Сервис omn-coin вправе отказать в выполнении операции обмена, покупки и продажи электронных/цифровых валют, если передача электронного актива на счет Сервиса была произведена без оформления Заявки при помощи пользовательских интерфейсов на Сайте Сервиса.

9.7. Администрация Сервиса имеет полное право отказать в предоставлении услуг любому Пользователю без объяснения причин.

9.8. Информация о Пользователе и о его операциях храниться на сервере и не может быть удалена.

9.9. Срок ответа службы поддержки Сервиса omn-coin может составлять до 24 часов с момента получения соответствующего запроса Пользователя.

Форс-мажор
10.1. Если в случае обстоятельств непреодолимой силы вы задерживаетесь с выполнением или не можете выполнить какое-либо из настоящих Условий, то такая задержка или несоблюдение не будут считаться нарушением настоящих Условий.

10.2. В свою очередь, Пользователь не может заявлять ни о каких убытках или ущербе, возникших из-за таких обстоятельств. Сервис, при форс-мажорных обстоятельствах в праве принять решение по заявке пользователя. Клиент в свою очередь обязуется выполнять все требования сервиса.

Электронное соглашение
11.1. Условия и положения согласовываются с Пользователем в электронной форме при нажатии кнопки «Я принимаю Пользовательское соглашениe и Политику по борьбе с отмыванием денег, Я подтверждаю право собственности на исходный криптоадрес и заявляю, что мои средства были получены из законных источников». Соглашение с Условиями, опубликованными в электронной форме, является действительным и идентичным письменному согласию.

11.2. Сервис omn-coin вправе в одностороннем порядке вносить изменения в Соглашение путем публикации изменений на Сайте Сервиса. Изменения вступают в силу с момента опубликования, если иной срок вступления изменений в силу не определен дополнительно при их публикации. Пользователь имеет право расторгнуть договорные отношения с Сервисом omn-coin из-за его несогласия с изменением таких Условий. Пользователь должен уведомить Сервис omn-coin о своем несогласии с изменением Условий и прекращению договорных отношений.

11.3. Сервис omn-coin вправе отправлять Пользователю на указанный им e-mail информацию рекламного характера.

11.4. Информация, размещенная на сайте, включая все графические изображения, текстовую информацию, коды программ и т.д., является собственностью omn-coin и защищена законами об авторском праве.

11.5. Пользователь подтверждает, что он ознакомлен со всеми положениями настоящих Условий и полностью принимает их.

Контактные данные
12.1. Вы можете обратиться в службу поддержки в рабочее время посредством доступного мессенджера, указанного на сайте omn-coin.

`
                        }),
                      }),
                      (0, s.jsx)("p", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "Торговля виртуальными активами и цифровыми активами также сопряжена с особыми рисками, которые обычно не свойственны официальным валютам. В отличие от большинства валют, которые поддерживаются правительствами или другими юридическими лицами, или такими товарами, как золото или серебро, виртуальные активы являются уникальным видом \xabнеобеспеченной\xbb валюты, поддерживаемой технологиями и доверием. В настоящее время нет государственного органа, который мог бы выпускать больше виртуальной валюты или принимать корректирующие меры для защиты стоимости виртуальных активов в условиях кризиса. При работе с цифровыми финансовыми активами могут существовать иные риски, не предусмотренные настоящим Пользовательским соглашением и Администрацией сайта Swapium.",
                        }),
                      }),
                      (0, s.jsx)("p", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Общие положения",
                          }),
                        }),
                      }),
                      (0, s.jsx)("p", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "Настоящее пользовательское соглашение (далее — Соглашение, Пользовательское соглашение) регулирует отношения между Swapium и Пользователями сайта Swapium, являющихся резидентами Российской Федерации.",
                        }),
                      }),
                      (0, s.jsx)("p", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "Используя сайт Swapium, Вы соглашаетесь с тем, что прочитали, поняли и приняли все условия, содержащиеся в настоящем Соглашении.",
                        }),
                      }),
                      (0, s.jsx)("p", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "Помимо условий настоящего пользовательского соглашения, Пользователь обязан (при необходимости) предоставить подтверждение легальности происхождения денежных средств и/или криптовалютных активов.",
                        }),
                      }),
                      (0, s.jsx)("p", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "В случае, если Вы не согласны с условиями Пользовательского соглашения, использование сайта Swapium не допускается.",
                        }),
                      }),
                      (0, s.jsx)("p", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Соответствие критериям",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "1.1. Настоящим вы соглашаетесь и подтверждаете, что вы: достигли установленного законом возраста, необходимого для принятия настоящих условий; вам не приостанавливали и не запрещали использование Сервисов ранее.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "1.2. Если вы используете Сервисы от имени юридического лица, вы также заявляете и гарантируете, что: юридическое лицо надлежащим образом зарегистрировано и действует в соответствии с действующим законодательством юрисдикции Российской Федерации, и данное юридическое лицо уполномочило вас действовать от его имени.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Термины и определения.",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.1. Swapium — это торговая марка системы, предоставляющей Пользователям возможность обмена цифровой и электронной валюты.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.2. Сервис — система предоставления интернет-услуг по обмену, продаже и покупке цифровых и/или электронных валют.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.3. Пользователь — это любое физическое/юридическое лицо, использующее услуги сервиса Swapium.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.4. Цифровая валюта — Bitcoin, Litecoin, Ethereum и любые иные валюты, основанные на блокчейне.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.5. Электронная валюта — денежные средства, находящиеся на счетах пользователей электронных платежных систем (Qiwi, Яндекс Деньги и др.).",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.6. Платежная система — программно-аппаратный продукт, разработанный третьей стороной и представляющий собой механизм реализации учета денежных обязательств, а также организации взаиморасчетов между своими пользователями.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.7. Услуги сервиса — оказание содействия в проведении р2р-операций между физическими лицами по купле-продаже и обмену цифровых валют, а также иные услуги, информация о которых размещена главной странице Сервиса.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.8. Платеж — перевод цифровой валюты или фиатных средств от Пользователя к Пользователю или Сервису, а также в обратном направлении.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.9. Заявка/Ордер — выражение намерения Пользователя воспользоваться одной из услуг, предлагаемых Сервисом, путем заполнения электронной формы через Интернет-сайт Сервиса, на условиях, описанных в Соглашении и указанных в параметрах этой Заявки.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.10. Партнер – лицо, оказывающее Сервису услуги по привлечению Пользователей, условия оказания которых описаны в настоящих Правилах.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "2.11. Курс — стоимостное соотношение двух цифровых валют при их обмене.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Правила пользования сайтом Swapium",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "3.1. Сайт Swapium предназначен для использования исключительно в личных целях. Пользуясь услугами данного сервиса, Вы даете свое согласие на передачу Swapium достоверных данных о себе. Вы так же даете согласие на обработку личных данных.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "3.2. Мы также можем проводить дополнительные проверки вашей информации и запрашивать у Вас любую необходимую документацию и данные связанные с обменом (паспорт, фотографию карты, видео-верификацию карты, квитанцию отправки средств и другие необходимые данные) по причине, связанной с использованием Вами услуг и/или в качестве подтверждающего доказательства для какой-либо информации, которую Вы предоставляете. Если условия предоставления данной информации не выполнены, сервис вправе отказать в предоставлении услуг без совершения возврата средств отправителю.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "Поскольку доступ к реестрам в связи с гео-политической ситуацией затруднен, граждане Российской Федерации совершая обмен, используя сервис Swapium, соглашаются с правилами предоставления дополнительной информации, а так же, в отдельных случаях, внесением залоговой суммы до конца прохождения процедуры дополнительной верификации. Залоговая сумма определяется органами регуляторов в лице комитета Государственной Думы Российской Федерации по Финансовому рынку. После завершения прохождения верификации, сервис обязуется совершить возврат залоговой суммы пользователю в полном размере и завершить приостановленный обмен.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "3.2.1 Сервис Swapium вправе заблокировать операцию Пользователя, в целях предотвращения мошеннических и других действий, которые могут нанести финансовые и репутационные потери для Сервиса или Пользователя, на срок требуемый для проведения финансового расследования и получения подробностей по транзакции от платежного шлюза или банка эмитента.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "3.3. Администрация сайта Swapium может в любое время и по своему собственному усмотрению приостановить транзакцию до окончания рассмотрения информации указанной в пункте 3.2, 3.7, 4.14, 7.4, предоставленной Вами.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "3.4. Вы признаете, что несете ответственность за сохранение строгой конфиденциальности информации о вашем обмене, защиту вашей собственной Цифровой валюты, а также за все действия и транзакции, размещенные на данном сервисе.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "3.5. Оповещения об изменениях. В случае допуска Вами ошибки при создании ордера и/или желании изменить данные ордера (кошелек получения, электронная почта, номер телефона и т.д.), Вы обязуетесь сообщить об изменениях в службу поддержки сервиса, указанную на сайте сервиса. Ни при каких обстоятельствах Компания не будет нести ответственность за убытки, которые вы можете понести в результате допуска ошибки при создании заявки на обмен цифровой или электронной валюты.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "3.6. Ответственность за действия третьих лиц. Вы несете полную ответственность за все действия или бездействие любой третьей стороны, осуществляющей доступ и/или использующей информацию о вашем обмене.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "3.7. Вы соглашаетесь с тем, что не будете использовать Сервисы для осуществления какой-либо преступной деятельности, включая, помимо прочего, покупку запрещенных веществ, отмывание денег, незаконные азартные игры, финансирование терроризма. Вы гарантируете, что будете строго придерживаться AML политики сервиса.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "Кроме того, Вы гарантируете, что не будете использовать методы для сокрытия местоположения, с которого Вы заходите на Сайт сервиса. Так же вы обязуетесь сообщать Компании по ее запросу Ваше точное и истинное местоположение. Если Компания на основе проведенного анализа транзакций пользователя, либо же с помощью специальных технических средств определит, что (Ваша деятельность) является подозрительной или связана с какой-либо запрещенной деятельностью или незаконной, сервис может приостановить обмен, заблокировать любые невыполненные транзакции, отклонить любые последующие транзакции. При этом, заблокированные обменные операции, не будут возвращены.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Услуги, предоставляемые сайтом Swapium",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.1. Воспользовавшись услугами Сервиса, Пользователь подтверждает, что законно владеет и распоряжается электронной и/или цифровой валютой, участвующими в соответствующем Платеже.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.2. Сервис оказывает следующие виды услуг: Услуга по предоставлению Пользователю возможности продать в режиме реального времени другому Пользователю электронную и/или цифровую валюту.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.3. Путем оформления Заявки Пользователь поручает, а Сервис от своего имени и за счет Пользователя, совершает действия по обмену/продаже цифровой и/или электронной валюты.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.4. Размер комиссии Сервиса за предоставление услуг составляет 1% от суммы заявки на обмен. Комиссия учитывается при создании Заявки Пользователем, который соглашается на ее взимание после принятия правил сервиса.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.5. В течение отведенного регламентом времени (зависимо от направления обмена) с момента получения денежных средств от Пользователя, в размере, указанном в соответствующей Заявке, Сервис может перечислить (передать) Полученную электронную или фиатную валюту на реквизиты и в размере, указанном Пользователем в Заявке, если этому не препятствуют форс-мажорные обстоятельства.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.6. Обменный пункт не располагает возможностью отменить/совершить возврат средств по заявке пользователя, замороженной сервисом по одной из причин указанных в пунктах 3.2, 3.7, 4.14, 7.4.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.7. Возможность Сервиса по перечислению (передаче) Полученной цифровой и/или электронной валюты Пользователю считается исполненной в момент списания цифровой и/или электронной валюты в соответствующей Платежной системе со счета Сервиса, что регистрируется в истории операций соответствующей Платежной системы.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.8. Путем оформления Заявки Пользователь поручает, а Сервис от своего имени и за счет Пользователя, покупает электронную и/или цифровую валюту у другого Пользователя, а также совершает действия по передаче денежного эквивалента Пользователю в сумме, указанной в Заявке.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.9. Все услуги сервиса Swapium предоставляются без каких-либо явных или подразумеваемых гарантий, в частности, без подразумеваемых гарантий товарной пригодности и пригодности для определенной цели. Компания не гарантирует, что услуги Swapium, а также сайт Swapium будут доступны в 100% случаев для удовлетворения Ваших потребностей. Компания будет стремиться предоставить вам свои услуги как можно скорее, но нет никаких гарантий, что доступ не будет прерван или что не будет никаких задержек, сбоев, ошибок, упущений или потери передаваемой информации.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "4.10. Swapium будет прилагать разумные усилия для обеспечения доступа к услугам и сайту Swapium в соответствии с настоящим Соглашением. Тем не менее, Swapium может приостановить использование сайта для технического обслуживания и приложит разумные усилия, чтобы предварительно уведомить Вас об этом. Таким образом, Вы соглашаетесь с тем, что принимаете на себя риски, связанные с тем фактом, что вы не всегда можете пользоваться услугами и сайтом Swapium или выполнять срочные транзакции.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsxs)("div", {
                        children: [
                          (0, s.jsx)("div", {
                            children: (0, s.jsx)("span", {
                              style: { fontSize: "18px" },
                              children: (0, s.jsx)("strong", {
                                children:
                                  "Дополнение к порядку оказания услуг:",
                              }),
                            }),
                          }),
                          (0, s.jsx)("div", { children: "\xa0" }),
                          (0, s.jsx)("div", {
                            children: (0, s.jsx)("span", {
                              style: { fontSize: "18px" },
                              children:
                                "4.11 Курс фиксируется при создании заявки, если Пользователь оплатил ее в течение 3 минут после создания. Если оплата не поступает в течение 3 минут, то курс более не фиксируется и сумма обмена может меняться в зависимости от рыночной цены монет выбранных пользователем для обмена. В таком случае, пользователь обязуется обратиться в службу поддержки сервиса для уточнения деталей по сумме оплаты заявки.",
                            }),
                          }),
                          (0, s.jsx)("div", { children: "\xa0" }),
                          (0, s.jsx)("div", {
                            children: (0, s.jsx)("span", {
                              style: { fontSize: "18px" },
                              children:
                                "4.12. Если Пользователь оплатил заявку, но в силу обстоятельств желает отказаться от обмена, то отправленные пользователем средства, возврату не подлежат.",
                            }),
                          }),
                          (0, s.jsx)("div", { children: "\xa0" }),
                          (0, s.jsx)("div", {
                            children: (0, s.jsx)("span", {
                              style: { fontSize: "18px" },
                              children:
                                "4.13. Заявку следует оплачивать исключительно через форму оплаты на сайте сервиса, которая доступна после нажатия кнопки \xabПерейти к оплате\xbb. Самовольная оплата по реквизитам не допускается. В противном случае заявка может быть аннулирована, а средства заморожены.",
                            }),
                          }),
                          (0, s.jsx)("div", { children: "\xa0" }),
                          (0, s.jsx)("div", {
                            children: (0, s.jsx)("span", {
                              style: { fontSize: "18px" },
                              children:
                                "4.14. Если Пользователь перевел некорректную сумму цифровых активов по оформленной заявке, Сервис имеет право заморозить данную транзакцию сроком до 48 часов. Пользователь имеет возможность разморозить транзакцию указав номер Заявки, подтвердив свою личность, а также проведя повторную операцию с того же электронного кошелька, с которого была некорректно списана первичная сумма, обратившись в службу поддержки сервиса.",
                            }),
                          }),
                          (0, s.jsx)("div", { children: "\xa0" }),
                          (0, s.jsx)("div", {
                            children: (0, s.jsx)("span", {
                              style: { fontSize: "18px" },
                              children:
                                "Повторный перевод должен быть осуществлен по реквизитам, указанным службой поддержки после заморозки ордера на обмен (в противном случае, транзакция не будет разморожена). После разморозки ордера, сервис обязуется выполнить обмен и совершить полный возврат средств, отправленных пользователем повторно.",
                            }),
                          }),
                        ],
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Стоимость услуг",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "5.1. Тарифы определяются руководством Сервиса и публикуются на сайте Сервиса. Руководство Сервиса вправе менять тарифы Сервиса без дополнительного уведомления.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Налогообложение",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "6.1. Сервис не является налоговым агентом для Пользователя и не будет уведомлять Пользователя относительно его налоговых издержек. Пользователь обязуется самостоятельно выплачивать все налоги, требуемые в соответствии с налоговым законодательством юрисдикции Российской Федерации.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "6.2. В случае, если от Сервиса властями требуется уплата налогов Пользователя или покрытие задолженности, возникшей в результате отказа Пользователя платить налоги, Пользователь соглашается возмещать Сервису все данные платежи.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Гарантии и ответственность сторон",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.1. Сервис Swapium предоставляет услуги по обмену, покупке и продаже электронных активов. Сервис Swapium не предоставляет услуги по сбору средств, не предоставляет услуг по оплате товаров.",
                        }),
                      }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.2. Сервис Swapium не несет ответственности перед Пользователем за финансовые потери, вызванные незаконными действиями третьих сторон, которые невозможно предсказать или предотвратить.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.3. Сервис Swapium не несет ответственности за любые отложенные или нереализованные Заявки, вызванные ошибкой другой Платежной системы или банка, указанными пользователем в оформленной Заявке. Пользователь соглашается с тем, что в таком случае все претензии будут направлены в платежную систему или банк. Сервис Swapium окажет необходимую помощь для подачи жалобы или требования другому партнеру или банку.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.4. Сумма в заявке пользователя и сумма отправленная пользователем по данной заявке должны полностью совпадать. В случае неучета комиссии, или же в другом случае несовпадения суммы, пользователь обязуется совершить повторный платеж правильной суммы с учетом данной комиссии. После успешного проведения повторной транзакции сервис обязуется совершить возврат обеих транзакций совершенных пользователем. В случае несоблюдения данного правила, средства пользователя будут заморожены. По истечению 48 часов средства обозначаться как утерянная криптовалюта и будут списаны со счета сервиса Swapium соответствующими органами регуляторов в лице Комитета Государственной Думы по финансовому рынку.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.5. В случае обнаружения фальсификации коммуникационных потоков или оказания какого-либо негативного влияния на нормальную работу программного кода Сервиса, имеющей прямое или косвенное отношение к Заявке Пользователя, исполнение Заявки Сервисом приостанавливается, а по уже полученным средствам производится перерасчет параметров Заявки в соответствии с действующими условиями.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.6. Сервис Swapium не несёт ответственности за частичное или полное несоблюдение данных Условий использования, если таковое явилось следствием обстоятельств непреодолимой силы, которые невозможно предотвратить разумными мерами.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.7. В других случаях неисполнение обязательств, вытекающих из настоящих Условий или нарушение отдельных условий, будет рассматриваться в соответствии с законодательством той страны, в юрисдикции которой находится Пользователь.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Ответственность Пользователя",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.8. Пользователь несет ответственность за достоверность и полноту информации и данных, которые он предоставил во время создания заявки. В случае, если Пользователь ввел неправильные личные данные или предоставил неверные данные для исполнения Заявки, Сервис Swapium не несёт ответственности за любые убытки Пользователя, возникшие в результате такой ошибки.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.9. В случае согласия с настоящими Условиями Пользователь честно заявляет и подтверждает, что:",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "- Он предоставил верную и правдивую информацию о себе, а также подлинные идентификационные данные / данные для обработки заявки;",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "- Он не является участником операций или сделок по отмыванию денег;",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "- Его доход не связан с осуществлением преступной и/или террористической деятельности;",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "- Его доход не связан с осуществлением торговли в странах, в которых торговля запрещена международными организациями;",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "- Его доход не связан с какой-либо другой незаконной деятельностью.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.10. Пользователь обязуется не нарушать работу Сервиса Swapium путем вмешательства в его программную или аппаратную части, а также путем искажения параметров, передаваемых Сервису.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.11. Пользователь признает и соглашается с тем, что Сервис Swapium не выступает в качестве финансового консультанта, не предоставляет консультационные услуги по инвестициям, и любая связь между Пользователем и Сервисом Swapium не может рассматриваться как совет.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.12. Пользователь не несет ответственность за частичное или полное несоблюдение настоящих Положений и Условий, если оно вызвано возникновением форс-мажорных обстоятельств, непредвиденных событий или предотвращено соответствующими мерами.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.13. В других случаях неисполнение обязательств, вытекающих из настоящих Условий и Положений или нарушение отдельных Положений и Условий, будет рассматриваться в соответствии с законодательством той страны, в юрисдикции которой находится Пользователь.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.14. В том случае, если клиент заметил несоответствие с трансляцией курсов на мониторингах. Клиент обязан оповестить об этом техническую поддержку сервиса.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "7.15. В том случае, если клиент воспользовался техническим сбоем на стороне обменного пункта Swapium и обменный пункт понесет финансовые, либо репутационные потери. Данные действия будут расценены как мошенничество. Клиент подлежит блокировке, а все не завершенные заявки могут быть удержаны для компенсации потерь сервиса.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Применимое право и подсудность",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "8.1. Настоящее соглашение, а также все споры, связанные с ним, подлежат рассмотрению в соответствии с законодательством Российской Федерации.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Прочие условия",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.1. Использование Сервиса Swapium в целях осуществления мошеннических и незаконных операций запрещено.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.2. Операторы сервиса Swapium юридически обязаны предоставлять информацию о платежах, Пользователях и Операциях любым государственным органам, имеющим законное право запрашивать соответствующую информацию.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.3. Защита информации Пользователей и других конфиденциальных данных граждан обеспечивается в соответствии с действующим законодательством о хранении персональных данных, в соответствии с юрисдикцией Российской Федерации.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.4. Способ обработки и защиты личной информации подробно описан в Политике конфиденциальности, опубликованной на веб-сайте Сервиса Swapium, требуемой для заключения договорных отношений между Пользователем и Сервисом Swapium.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.5. Сервис Swapium, в случае подозрительных действий в процессе оформления заявки Пользователем, во избежание ущерба от хакерских атак, вправе приостанавливать выполнение таких операций до выяснения причин этих действий.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.6. Сервис Swapium вправе отказать в выполнении операции обмена, покупки и продажи электронных/цифровых валют, если передача электронного актива на счет Сервиса была произведена без оформления Заявки при помощи пользовательских интерфейсов на Сайте Сервиса.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.7. Администрация Сервиса имеет полное право отказать в предоставлении услуг любому Пользователю без объяснения причин.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.8. Информация о Пользователе и о его операциях храниться на сервере и не может быть удалена.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "9.9. Срок ответа службы поддержки Сервиса Swapium может составлять до 24 часов с момента получения соответствующего запроса Пользователя.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "Форс-мажор",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "10.1. Если в случае обстоятельств непреодолимой силы вы задерживаетесь с выполнением или не можете выполнить какое-либо из настоящих Условий, то такая задержка или несоблюдение не будут считаться нарушением настоящих Условий.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "В свою очередь, Пользователь не может заявлять ни о каких убытках или ущербе, возникших из-за таких обстоятельств. Сервис, при форс-мажорных обстоятельствах в праве принять решение по заявке пользователя. Клиент в свою очередь обязуется выполнять все требования сервиса.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "11. Заключительные положения.",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "11.1. Условия и положения согласовываются с Пользователем в электронной форме при нажатии кнопки \xabЯ принимаю Пользовательское соглашениe и Политику по борьбе с отмыванием денег, Я подтверждаю право собственности на исходный криптоадрес и заявляю, что мои средства были получены из законных источников\xbb. Соглашение с Условиями, опубликованными в электронной форме, является действительным и идентичным письменному согласию.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "11.2. Сервис Swapium вправе в одностороннем порядке вносить изменения в Соглашение путем публикации изменений на Сайте Сервиса. Изменения вступают в силу с момента опубликования, если иной срок вступления изменений в силу не определен дополнительно при их публикации. Пользователь имеет право расторгнуть договорные отношения с Сервисом Swapium из-за его несогласия с изменением таких Условий. Пользователь должен уведомить Сервис Swapium о своем несогласии с изменением Условий и прекращению договорных отношений.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "11.3. Сервис Swapium вправе отправлять Пользователю на указанный им e-mail информацию рекламного характера.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "11.4. Информация, размещенная на сайте, включая все графические изображения, текстовую информацию, коды программ и т.д., является собственностью Swapium. и защищена законами об авторском праве.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "11.5. Пользователь подтверждает, что он ознакомлен со всеми положениями настоящих Условий и полностью принимает их.",
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children: (0, s.jsx)("strong", {
                            children: "12. Контактные данные",
                          }),
                        }),
                      }),
                      (0, s.jsx)("div", { children: "\xa0" }),
                      (0, s.jsx)("div", {
                        children: (0, s.jsx)("span", {
                          style: { fontSize: "18px" },
                          children:
                            "12.1. Вы можете обратиться в службу поддержки в рабочее время посредством доступного мессенджера, указанного на сайте Swapium.",
                        }),
                      }),
                    ],
                  }),
                }),
              }),
            }),
          ],
        });
      };
    },
    2743: (e, i, n) => {
      "use strict";
      n.d(i, { default: () => r });
      var s = n(5155);
      n(2115);
      var d = n(6046);
      let l = [
          { name: "Обмен", href: "/" },
          { name: "О нас", href: "/about" },
          { name: "Правила", href: "/rules" },
          { name: "Партнёрская программа", href: "/referral" },
          { name: "AML/KYC", href: "/aml/kyc" },
        ],
        r = () => {
          let e = (0, d.usePathname)();
          return (0, s.jsxs)("footer", {
            children: [
              (0, s.jsxs)("nav", {
                className: "nav-panel nav-panel-bottom",
                children: [
                  (0, s.jsxs)("div", {
                    className: "nav-panel-logo-container",
                    children: [
                      (0, s.jsx)("div", { className: "nav-panel-logo" }),
                      (0, s.jsx)("span", {
                        className: "nav-panel-logo-text",
                        children:
                          "Полуавтоматический сервис по обмену цифровых валют",
                      }),
                    ],
                  }),
                  (0, s.jsx)("div", {
                    children: (0, s.jsx)("ul", {
                      className: "nav-panel-main-menu",
                      children: l.map((i) =>
                        (0, s.jsx)(
                          "li",
                          {
                            className: "nav-panel-item",
                            children: (0, s.jsx)("a", {
                              className: "nav-panel-link ".concat(
                                e === i.href ? "active" : ""
                              ),
                              href: i.href,
                              children: i.name,
                            }),
                          },
                          i.href
                        )
                      ),
                    }),
                  }),
                  (0, s.jsx)("div", {
                    className: "nav-panel-schedule",
                    children: (0, s.jsxs)("div", {
                      className: "timer-container",
                      children: [
                        (0, s.jsx)("div", { className: "timer-image" }),
                        (0, s.jsx)("span", {
                          className: "timer-text",
                          children: "c 10:00 до 22:00(МСК)",
                        }),
                      ],
                    }),
                  }),
                ],
              }),
              (0, s.jsx)("div", {
                className: "copyrights",
                children:
                  "\xa9 2025 Swapium. Копирование материалов только с разрешения правообладателя.",
              }),
            ],
          });
        };
    },
    5725: (e, i, n) => {
      "use strict";
      n.d(i, { default: () => x });
      var s = n(5155),
        d = n(2115),
        l = n(6046);
      let r = [
          { name: "Обмен", href: "/" },
          { name: "О нас", href: "/about" },
          { name: "Правила", href: "/rules" },
          { name: "Партнёрская программа", href: "/referral" },
          { name: "Контакты", href: "/contacts" },
          { name: "AML/KYC", href: "/aml/kyc" },
        ],
        x = () => {
          let e = (0, l.usePathname)(),
            [i, n] = (0, d.useState)(!1);
          return (0, s.jsxs)(s.Fragment, {
            children: [
              (0, s.jsx)("nav", {
                className: "nav-panel nav-panel-top",
                children: (0, s.jsxs)("div", {
                  className: "nav-panel-wrapper nav-panel-desktop",
                  children: [
                    (0, s.jsxs)("div", {
                      className: "nav-panel-left",
                      children: [
                        (0, s.jsx)("a", {
                          className: "nav-panel-logo",
                          href: "/",
                          children: (0, s.jsx)("img", {
                            src: "/logo.svg",
                            alt: "",
                            style: { width: "100%" },
                          }),
                        }),
                        (0, s.jsx)("ul", {
                          className: "nav-panel-main-menu",
                          children: r.map((i) =>
                            (0, s.jsx)(
                              "li",
                              {
                                className: "nav-panel-item",
                                children: (0, s.jsx)("a", {
                                  className: "nav-panel-link ".concat(
                                    e === i.href ? "active" : ""
                                  ),
                                  href: i.href,
                                  children: i.name,
                                }),
                              },
                              i.href
                            )
                          ),
                        }),
                      ],
                    }),
                    (0, s.jsxs)("div", {
                      className: "nav-panel-right",
                      children: [
                        (0, s.jsx)("a", {
                          className:
                            "nav-panel-link register-nav-link button button-primary",
                          href: "https://t.me/swapium_io",
                          children: "Поддержка",
                        }),
                        (0, s.jsx)("button", {
                          "data-bs-toggle": "modal",
                          id: "#mobileNavigationModal",
                          "data-bs-target": "#mobileNavigationModal",
                          className: "nav-panel-toggler",
                          type: "button",
                          onClick: () => n(!i),
                        }),
                      ],
                    }),
                  ],
                }),
              }),
              (0, s.jsx)("div", {
                className: "modal mobile-navigation-modal ".concat(
                  i ? "show" : ""
                ),
                id: "mobileNavigationModal",
                "aria-hidden": !i,
                children: (0, s.jsx)("div", {
                  className: "modal-dialog modal-fullscreen",
                  children: (0, s.jsx)("div", {
                    className: "modal-content",
                    children: (0, s.jsxs)("div", {
                      className: "modal-body",
                      children: [
                        (0, s.jsxs)("div", {
                          className: "nav-panel-mobile-top-block",
                          children: [
                            (0, s.jsx)("div", { className: "nav-panel-logo" }),
                            (0, s.jsx)("button", {
                              type: "button",
                              className:
                                "nav-panel-mobile-close modal-close-button",
                              "data-bs-dismiss": "modal",
                              "aria-label": "Закрыть",
                              onClick: () => n(!i),
                            }),
                          ],
                        }),
                        (0, s.jsx)("ul", {
                          className: "nav-panel-main-menu",
                          children: r.map((i) =>
                            (0, s.jsx)(
                              "li",
                              {
                                className: "nav-panel-item",
                                children: (0, s.jsx)("a", {
                                  className: "nav-panel-link ".concat(
                                    e === i.href ? "active" : ""
                                  ),
                                  href: i.href,
                                  children: i.name,
                                }),
                              },
                              i.href
                            )
                          ),
                        }),
                      ],
                    }),
                  }),
                }),
              }),
            ],
          });
        };
    },
  },
  (e) => {
    var i = (i) => e((e.s = i));
    e.O(0, [441, 517, 358], () => i(7389)), (_N_E = e.O());
  },
]);
